<a href="https://colab.research.google.com/github/shivamshinde70/dsbda/blob/main/Assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("dataset_Facebook.csv")
df

    Page total likes;Type;Category;Post Month;Post Weekday;Post Hour;Paid;Lifetime Post Total Reach;Lifetime Post Total Impressions;Lifetime Engaged Users;Lifetime Post Consumers;Lifetime Post Consumptions;Lifetime Post Impressions by people who have liked your Page;Lifetime Post reach by people who like your Page;Lifetime People who have liked your Page and engaged with your post;comment;like;share;Total Interactions
0    139441;Photo;2;12;4;3;0;2752;5091;178;109;159;...
1    139441;Status;2;12;3;10;0;10460;19057;1457;136...
2    139441;Photo;3;12;3;3;0;2413;4373;177;113;154;...
3    139441;Photo;2;12;2;10;1;50128;87991;2211;790;...
4    139441;Photo;2;12;2;3;0;7244;13594;671;410;580...
..                                                 ...
495  85093;Photo;3;1;7;2;0;4684;7536;733;708;985;47...
496  81370;Photo;2;1;5;8;0;3480;6229;537;508;687;39...
497  81370;Photo;1;1;5;2;0;3778;7216;625;572;795;47...
498  81370;Photo;3;1;4;11;0;4156;7564;626;574;832;4...
499  81370;Photo;2;1;4;4;;4188;7292;564;524;743;386...

[500 rows x 1 columns]

In [ ]:
df.shape

(99003, 15)

In [ ]:
dataset1 = df.head(10)

In [ ]:
print(dataset1)

    userid  age  dob_day  dob_year  dob_month  gender  tenure  friend_count  \
0  2094382   14       19      1999         11    male   266.0             0
1  1192601   14        2      1999         11  female     6.0             0
2  2083884   14       16      1999         11    male    13.0             0
3  1203168   14       25      1999         12  female    93.0             0
4  1733186   14        4      1999         12    male    82.0             0
5  1524765   14        1      1999         12    male    15.0             0
6  1136133   13       14      2000          1    male    12.0             0
7  1680361   13        4      2000          1  female     0.0             0
8  1365174   13        1      2000          1    male    81.0             0
9  1712567   13        2      2000          2    male   171.0             0

   friendships_initiated  likes  likes_received  mobile_likes  \
0                      0      0               0             0
1                      0      0               0             0
2                      0      0               0             0
3                      0      0               0             0
4                      0      0               0             0
5                      0      0               0             0
6                      0      0               0             0
7                      0      0               0             0
8                      0      0               0             0
9                      0      0               0             0

   mobile_likes_received  www_likes  www_likes_received
0                      0          0                   0
1                      0          0                   0
2                      0          0                   0
3                      0          0                   0
4                      0          0                   0
5                      0          0                   0
6                      0          0                   0
7                      0          0                   0
8                      0          0                   0
9                      0          0                   0

In [ ]:
dataset2 = df.iloc[[2,9,15,25]]

In [ ]:
print(dataset2)

     userid  age  dob_day  dob_year  dob_month  gender  tenure  friend_count  \
2   2083884   14       16      1999         11    male    13.0             0
9   1712567   13        2      2000          2    male   171.0             0
15  1751722   13        7      2000          4  female    16.0             0
25  1001243   15       11      1998         11    male    28.0             0

    friendships_initiated  likes  likes_received  mobile_likes  \
2                       0      0               0             0
9                       0      0               0             0
15                      0      0               0             0
25                      0      0               0             0

    mobile_likes_received  www_likes  www_likes_received
2                       0          0                   0
9                       0          0                   0
15                      0          0                   0
25                      0          0                   0

In [ ]:
dataset3 = df.loc[0 : 4 ,["age","dob_day"] ]

   age  dob_day
0   14       19
1   14        2
2   14       16
3   14       25
4   14        4

In [ ]:
dataset2 = df.iloc[[3,5,9,45]]

In [ ]:
print(dataset2)

     userid  age  dob_day  dob_year  dob_month  gender  tenure  friend_count  \
3   1203168   14       25      1999         12  female    93.0             0
5   1524765   14        1      1999         12    male    15.0             0
9   1712567   13        2      2000          2    male   171.0             0
45  1784528   14        8      1999          3    male     0.0             0

    friendships_initiated  likes  likes_received  mobile_likes  \
3                       0      0               0             0
5                       0      0               0             0
9                       0      0               0             0
45                      0      0               0             0

    mobile_likes_received  www_likes  www_likes_received
3                       0          0                   0
5                       0          0                   0
9                       0          0                   0
45                      0          0                   0

In [ ]:
df.head

<bound method NDFrame.head of         userid  age  dob_day  dob_year  dob_month  gender  tenure  \
0      2094382   14       19      1999         11    male   266.0
1      1192601   14        2      1999         11  female     6.0
2      2083884   14       16      1999         11    male    13.0
3      1203168   14       25      1999         12  female    93.0
4      1733186   14        4      1999         12    male    82.0
...        ...  ...      ...       ...        ...     ...     ...
98998  1268299   68        4      1945          4  female   541.0
98999  1256153   18       12      1995          3  female    21.0
99000  1195943   15       10      1998          5  female   111.0
99001  1468023   23       11      1990          4  female   416.0
99002  1397896   39       15      1974          5  female   397.0

       friend_count  friendships_initiated  likes  likes_received  \
0                 0                      0      0               0
1                 0                      0      0               0
2                 0                      0      0               0
3                 0                      0      0               0
4                 0                      0      0               0
...             ...                    ...    ...             ...
98998          2118                    341   3996           18089
98999          1968                   1720   4401           13412
99000          2002                   1524  11959           12554
99001          2560                    185   4506            6516
99002          2049                    768   9410           12443

       mobile_likes  mobile_likes_received  www_likes  www_likes_received
0                 0                      0          0                   0
1                 0                      0          0                   0
2                 0                      0          0                   0
3                 0                      0          0                   0
4                 0                      0          0                   0
...             ...                    ...        ...                 ...
98998          3505                  11887        491                6202
98999          4399                  10592          2                2820
99000         11959                  11462          0                1092
99001          4506                   5760          0                 756
99002          9410                   9530          0                2913

[99003 rows x 15 columns]>

In [ ]:
df.tail

<bound method NDFrame.tail of         userid  age  dob_day  dob_year  dob_month  gender  tenure  \
0      2094382   14       19      1999         11    male   266.0
1      1192601   14        2      1999         11  female     6.0
2      2083884   14       16      1999         11    male    13.0
3      1203168   14       25      1999         12  female    93.0
4      1733186   14        4      1999         12    male    82.0
...        ...  ...      ...       ...        ...     ...     ...
98998  1268299   68        4      1945          4  female   541.0
98999  1256153   18       12      1995          3  female    21.0
99000  1195943   15       10      1998          5  female   111.0
99001  1468023   23       11      1990          4  female   416.0
99002  1397896   39       15      1974          5  female   397.0

       friend_count  friendships_initiated  likes  likes_received  \
0                 0                      0      0               0
1                 0                      0      0               0
2                 0                      0      0               0
3                 0                      0      0               0
4                 0                      0      0               0
...             ...                    ...    ...             ...
98998          2118                    341   3996           18089
98999          1968                   1720   4401           13412
99000          2002                   1524  11959           12554
99001          2560                    185   4506            6516
99002          2049                    768   9410           12443

       mobile_likes  mobile_likes_received  www_likes  www_likes_received
0                 0                      0          0                   0
1                 0                      0          0                   0
2                 0                      0          0                   0
3                 0                      0          0                   0
4                 0                      0          0                   0
...             ...                    ...        ...                 ...
98998          3505                  11887        491                6202
98999          4399                  10592          2                2820
99000         11959                  11462          0                1092
99001          4506                   5760          0                 756
99002          9410                   9530          0                2913

[99003 rows x 15 columns]>

In [ ]:
df.columns

Index(['userid', 'age', 'dob_day', 'dob_year', 'dob_month', 'gender', 'tenure',
       'friend_count', 'friendships_initiated', 'likes', 'likes_received',
       'mobile_likes', 'mobile_likes_received', 'www_likes',
       'www_likes_received'],
      dtype='object')

In [ ]:
d1 = pd.DataFrame({"City":["Mumbai","Nashik","Banglore"] , " temperature":["24", "27" ,"30"]})

In [ ]:
print(d1)

       City  temperature
0    Mumbai           24
1    Nashik           27
2  Banglore           30

In [ ]:
d2 = pd.DataFrame({"City":["Mumbai", "Pune", "Nagpur"], "Temperature":["24", "22", "19"],})

In [ ]:
print(d2)

     City Temperature
0  Mumbai          24
1    Pune          22
2  Nagpur          19

In [ ]:
d4 = pd.DataFrame({"Student Name":["Pratham","Mahesh","Nayan","Abhishek"], "Roll No":["307A057", "307A063", "307A076", "307B015"], "Mobile No":["9784556781", "9878654598", "8754659831", "7845983246"], "Age":["20", "21", "19","20"],})

In [ ]:
print(d4)

  Student Name  Roll No   Mobile No Age
0      Pratham  307A057  9784556781  20
1       Mahesh  307A063  9878654598  21
2        Nayan  307A076  8754659831  19
3     Abhishek  307B015  7845983246  20

In [ ]:
d4.sort_values("Student Name")

  Student Name  Roll No   Mobile No Age
3     Abhishek  307B015  7845983246  20
1       Mahesh  307A063  9878654598  21
2        Nayan  307A076  8754659831  19
0      Pratham  307A057  9784556781  20

In [ ]:
NewData = d4[["Student Name", "Mobile No"]]

In [ ]:
print(NewData)

  Student Name   Mobile No
0      Pratham  9784556781
1       Mahesh  9878654598
2        Nayan  8754659831
3     Abhishek  7845983246

In [ ]:
d5 = pd.merge(d1, d2, on = "City")

In [ ]:
d5

     City  temperature Temperature
0  Mumbai           24          24

In [ ]:
d5 = pd.merge(d1, d2, on = "City", how = "outer")

In [ ]:
d5

       City  temperature Temperature
0    Mumbai           24          24
1    Nashik           27         NaN
2  Banglore           30         NaN
3      Pune          NaN          22
4    Nagpur          NaN          19

In [ ]:
d5 = pd.merge(d1, d2, on = "City", how = "left")

In [ ]:
d5

       City  temperature Temperature
0    Mumbai           24          24
1    Nashik           27         NaN
2  Banglore           30         NaN

In [ ]:
d5 = pd.merge(d1, d2, on = "City", how = "left", indicator = "float")

In [ ]:
d5

       City  temperature Temperature      float
0    Mumbai           24          24       both
1    Nashik           27         NaN  left_only
2  Banglore           30         NaN  left_only

In [ ]:
d5 = pd.merge(d1, d2, on = "City", how = "left", indicator = "true")

In [ ]:
d5

       City  temperature Temperature       true
0    Mumbai           24          24       both
1    Nashik           27         NaN  left_only
2  Banglore           30         NaN  left_only

In [ ]:
d6 = d5.stack()

In [ ]:
d6

0  City               Mumbai
    temperature           24
   Temperature            24
   true                 both
1  City               Nashik
    temperature           27
   true            left_only
2  City             Banglore
    temperature           30
   true            left_only
dtype: object

In [ ]:
d6.unstack()

       City  temperature Temperature       true
0    Mumbai           24          24       both
1    Nashik           27         NaN  left_only
2  Banglore           30         NaN  left_only

In [ ]:
d7 = d5.T

In [ ]:
d7

                   0          1          2
City          Mumbai     Nashik   Banglore
 temperature      24         27         30
Temperature       24        NaN        NaN
true            both  left_only  left_only